
{
    "mystic_arcana": [
        {
            "id": "68d0575a1ad5bb78200db0ee",
            "title": "3I/ATLAS Cosmic Abduction T-Shirt",
            "description": "Elevate your wardrobe with this Unisex Triblend Tee , designed to merge soft comfort with stellar style. This shirt features a bold cosmic graphic of a UFO unleashing an electric beam through stormy skies, captured in vivid neon and space-inspired hues. The 3I/ATLAS branding grounds the design in a sci-fi narrative, making this tee a standout addition to any casual outfit! Whether you're heading to a music festival, gaming night, or just repping your cosmic vibe on the street, this shirt fits right into a lifestyle of originality and imagination. It also makes a memorable gift for fans of galactic fashion , retro sci-fi , or bold statement pieces . Product Features Tri-blend fabric offers exceptional softness and long-lasting wear Side seams enhance structure and support shape retention over time Ribbed knit collar maintains its shape wash after wash Shoulder taping adds stability and prevents stretching Lightweight material ensures breathable comfort for all-day wear Care Instructions Machine wash: warm (max 40°C or 105°F), gentle cycle Do not bleach Tumble dry: low heat Iron, steam, or dry: medium heat Do not dry clean S M L XL 2XL Width, in 17.99 20.00 21.97 23.98 25.98 Length, in 27.99 28.98 30.00 30.98 31.97",
            "image_url": "https://images-api.printify.com/mockup/68d0575a1ad5bb78200db0ee/40699/109464/3iatlas-cosmic-abduction-t-shirt.jpg?camera_label=front",
            "shop": "Mystic Arcana Pop-up"
        },
        {
            "id": "68cfaffb4a1cc466510fc110",
            "title": "Alien DJ Graphic Tee — Neon Cosmic Retro Unisex Tee",
            "description": "Bring the dancefloor home with this Alien DJ tee — a vivid, neon‑infused graphic print tee that merges sci‑fi art, festival energy, and music culture. Whether you’re heading to a rave, chilling with friends, or just want your vibe to stand out, this shirt delivers bold style and expressive personality in equal measure. Key Features Striking Graphic Design — High‑contrast alien DJ artwork with vibrant neons (purple, greens, blues), glowing equalizer effects, turntables, and bold visual energy Soft & Comfortable Fabric — Made from premium cotton or a cotton blend, comfy enough for all‑day wear Unisex Fit — Roomy, gender‑neutral cut so it suits all body types with relaxed comfort Versatile Styling — Wear alone, under jackets, with shorts or jeans; ideal for festivals, concerts, or casual wear Multiple Color Options — Tee base colors that enhance the artwork and match different styles Why You’ll Love It A statement piece for music lovers and sci‑fi fans alike — the alien‑DJ imagery ties identity and fandom together Great gift idea for DJs, artists, and anyone who loves bold, glow‑inspired graphics Durable print that holds up over time when properly cared for: the artwork maintains color, line‑work, and vibrancy Opportunities for layering and pairing—boosts outfit versatility (festival looks, streetwear, casual hangouts) XS S M L XL 2XL 3XL 4XL 5XL Width, in 16.50 18.00 20.00 22.00 24.00 26.00 28.00 30.00 32.00 Length, in 27.00 28.00 29.00 30.00 31.00 32.00 33.00 34.00 35.00 Sleeve length, in 8.60 8.90 9.20 9.50 9.70 10.00 10.40 10.80 11.20 Size tolerance, in 1.50 1.50 1.50 1.50 1.50 1.50 1.50 1.50 1.50",
            "image_url": "https://images-api.printify.com/mockup/68cfaffb4a1cc466510fc110/18542/92547/alien-dj-graphic-tee... [truncated]",
            "shop": "Mystic Arcana Pop-up"
        },
        {
            "id": "68d057551ad5bb78200db0e7",
            "title": "Ceramic Ornaments, 2-Side Print",
            "description": "Whether it's adding a beautiful flair to your Christmas tree or lighting up a corner of your household, this ceramic ornament is the perfect decorative touch for all your needs. Features vibrant 2-side print, and comes with a gold hanging cord for extra convenience out the box. .: Material: 100% ceramic .: Four shapes to choose from .: Includes gold color string for hanging",
            "image_url": "https://images-api.printify.com/mockup/68d057551ad5bb78200db0e7/111546/109570/ceramic-ornaments-2-side-print.jpg?camera_label=front",
            "shop": "Mystic Arcana Pop-up"
        }
    ],
    "edm_shuffle": [
        {
            "id": "68cfa59c08ca4dcdc40590eb",
            "title": "AirPods and AirPods Pro Case Cover",
            "description": "This custom AirPods cover safeguards your AirPods/AirPods Pro against bumps, scratches, and drops. With each personalized AirPod case you also get a metal carabiner for secure, effortless transportation. Compatible with the regular and wireless charging case for Airpods and AirPods Pro. Both AirPod and Airpod Pro cases are available in 5x colors: White, Navy, Pink, Mint, and Black. .: Material: Premium Thermoplastic Polyurethane (TPU) .: Great protection from drops and scratches .: NB! AirPods case cover is compatible with 1st and 2nd generations AirPods; AirPodsPro case cover is compatible with 1st generation AirPods Pro .: Stipple print texture .: Metal carabiner included .: The cover works with both wireless and regular charging ports",
            "image_url": "https://images-api.printify.com/mockup/68cfa59c08ca4dcdc40590eb/72110/24319/airpods-and-airpods-pro-case-cover.jpg?camera_label=front",
            "shop": "EDM Shuffle pop-up"
        },
        {
            "id": "68cfa5a108ca4dcdc40590f0",
            "title": "Cosmic 'Astral Voyager'- Sci-Fi Art Poster",
            "description": "Bring cosmic wonder into your space with The Astral Voyager matte poster, a psychedelic wall art print that blends fantasy, sci-fi, and spiritual symbolism. Featuring a multi-limbed voyager with a radiant third eye surrounded by swirling galaxies, vibrant planets, and electric hues of blue, magenta, and purple, this cosmic art print makes a bold statement in any setting—whether it's home decor, dorm room style, a creative studio, or a wellness space. Perfect for sci-fi fans, spiritual seekers, and lovers of galaxy wall decor, The Astral Voyager ignites imagination, sparks conversation, and transforms any room into a portal of discovery. Made with museum-grade archival paper for excellent printing fidelity and vibrant color reproduction. Paper weight: 175 g/m² (Sensaria and Prodigi), 189 g/m² (Printify Choice). Find the perfect match to your customers' needs with 46 available sizes. For indoor use only. Please note: Due to the production process of these posters, please allow for slight size deviations with a tolerance +/- 1/16 8x10 inches.",
            "image_url": "https://images-api.printify.com/mockup/68cfa5a108ca4dcdc40590f0/114557/106501/cosmic-astral-voyager-sci-fi-art-poster.jpg?camera_label=front",
            "shop": "EDM Shuffle pop-up"
        },
        {
            "id": "68cfa63dd214a8512104b5e0",
            "title": "Cosmic Wanderer's Warp: 3I/ATLAS Inspired Pink Alien Fanny Pack",
            "description": "Journey beyond the mundane with our out-of-this-world fanny pack, a truly stellar accessory designed for the modern explorer. Featuring an eye-catching pattern of playful pink aliens set against a vast, cosmic black background adorned with twinkling stars and mysterious UFOs, this waist bag is more than just a place to stash your essentials—it's a statement! This unique design is brilliantly inspired by the fleeting beauty and enigmatic allure of Comet 3I/ATLAS, capturing the wonder of interstellar discovery and bringing it straight to your everyday adventures. Perfect for festival circuits, urban explorations, or simply adding a touch of the extraordinary to your daily routine, this space-themed accessory ensures your style is always light-years ahead. Whether you're navigating bustling city streets or dancing under the open sky, enjoy the ultimate hands-free convenience with a piece that perfectly blends quirky fashion with celestial charm. Make a bold statement that echoes the universe’s endless possibilities and carry a piece of the cosmos, wherever your global travels or local explorations may take you. One size Height, in 6.00 Length, in 12.99 Strap width, in 0.98 Min circumference, in 39.37 Max circumference, in 53.54",
            "image_url": "https://images-api.printify.com/mockup/68cfa63dd214a8512104b5e0/65045/6109/cosmic-wanderers-warp-3iatlas-inspired-pink-alien-fanny-pack.jpg?camera_label=front",
            "shop": "EDM Shuffle pop-up"
        }
    ],
    "birthday_gen": [
        {
            "id": "68cfa726c4e7b96d000a2f3c",
            "title": "Cosmic Wanderer's Warp: 3I/ATLAS Inspired Pink Alien Fanny Pack",
            "description": "Journey beyond the mundane with our out-of-this-world fanny pack, a truly stellar accessory designed for the modern explorer. Featuring an eye-catching pattern of playful pink aliens set against a vast, cosmic black background adorned with twinkling stars and mysterious UFOs, this waist bag is more than just a place to stash your essentials—it's a statement! This unique design is brilliantly inspired by the fleeting beauty and enigmatic allure of Comet 3I/ATLAS, capturing the wonder of interstellar discovery and bringing it straight to your everyday adventures. Perfect for festival circuits, urban explorations, or simply adding a touch of the extraordinary to your daily routine, this space-themed accessory ensures your style is always light-years ahead. Whether you're navigating bustling city streets or dancing under the open sky, enjoy the ultimate hands-free convenience with a piece that perfectly blends quirky fashion with celestial charm. Make a bold statement that echoes the universe’s endless possibilities and carry a piece of the cosmos, wherever your global travels or local explorations may take you. One size Height, in 6.00 Length, in 12.99 Strap width, in 0.98 Min circumference, in 39.37 Max circumference, in 53.54",
            "image_url": "https://images-api.printify.com/mockup/68cfa726c4e7b96d000a2f3c/65045/6109/cosmic-wanderers-warp-3iatlas-inspired-pink-alien-fanny-pack.jpg?camera_label=front",
            "shop": "BirthdayGen Popup"
        },
        {
            "id": "68cfa47153401ee3a208412c",
            "title": "Cotton Cosmetic Bag",
            "description": "There's no such thing as too many bags! This cotton drill bag is bound to be a welcome addition to any home. Made with 100% drill cotton, these bags are not only pretty but can also withstand constant traveling and daily use. Available in multiple sizes to best fit your needs, each cosmetic bag comes with a handy zipper and lightweight construction. .: 100% cotton drill .: 5 size options .: All over print .: White or black plastic zipper (picked according to design colors)",
            "image_url": "https://images-api.printify.com/mockup/68cfa47153401ee3a208412c/80016/46415/cotton-cosmetic-bag.jpg?camera_label=front",
            "shop": "BirthdayGen Popup"
        },
        {
            "id": "68cfa47253401ee3a208412f",
            "title": "Elevate Your Style with Our 3I-ATLAS Feature Series- Alien Print Tote Bag (AOP)",
            "description": "Discover the perfect blend of functionality and fashion with our stunning custom-printed tote bags. our alien-themed series is inspired by the cosmic phenomena, '3I-ATLAS,' so these products are available for a limited time only! Key Features: - Durable Design- Crafted from 100% spun polyester, our medium-weight fabric (6.49 oz/yd²) ensures your tote bag withstands daily wear and tear while maintaining its vibrant appearance. - Customizable Options- Choose from five eye-catching handle colors to perfectly complement your personalized designs. Stand out in any crowd! - Spacious & Practical- Available in three sizes, each featuring a large storage compartment, these totes provide ample space for all your essentials- whether it's groceries, gym gear, or beach day must-haves, this limited-time printed piece is sure to stand out. - High-End Finishing Touches- Enjoy the luxury of double-stitched seams and cotton webbing straps that enhance durability while offering comfort. Plus, the nonwoven laminate lining inside adds an extra layer of protection against spills and messes. - Vivid Visuals- Our all-over print is created using advanced dye sublimation technology, ensuring that your designs pop with rich colors and high-definition details. Why Choose Us? With size tolerance at ±0.75"" (1.9 cm), you can trust that our tote bags are designed for real-world use without compromising on style or quality. Ready to Make a Statement? Don't miss out on this opportunity to elevate your everyday carry! Click now to explore our range of customizable tote bags and find the perfect match for your lifestyle. 13"" × 13'' Height, in 13.00 Length, in 13.00 Width, in 3.00 Handle length, in 28.74 Handle width, in 1.00",
            "image_url": "https://images-api.printify.com/mockup/68cfa47253401ee3a208412f/103599/100877/elevate-your-style-with-our-3i-atlas-feature-series-alien-print-t... [truncated]",
            "shop": "BirthdayGen Popup"
        }
    ],
    "3i_atlas": [
        {
            "id": "68cf870d4a1cc466510fb857",
            "title": "3I/ATLAS Mystic Eye Wall Tapestry — Cosmic Symbol Art for Bedroom & Studio Decor",
            "description": "Transform your wall into a focal point with the 3I/ATLAS Mystic Eye Wall Tapestry, a striking blend of cosmic symbolism, vibrant color, and surreal artistry. Featuring a hypnotic “all‑seeing eye” motif surrounded by planetary symbols and glowing neon accents, this tapestry brings mystical energy, wall‑worthy style, and immersive depth into any space. Key Features Bold Cosmic Design — Intricate “Mystic Eye” centerpiece encircled by celestial glyphs; neon purples, electric blues, and gold tones offer light & contrast for dramatic effect. Large Format & High‑Quality Print — Generously sized tapestry with crisp, fade‑resistant printing on premium fabric so the artwork retains detail and vibrancy. Easy Display & Versatile Décor — Lightweight material allows simple wall hanging (with clips, rods, or pushpins); ideal for bedrooms, dorms, studios, meditation spaces, or music‑video backdrops. Spiritual & Symbolic Appeal — The eye motif and surrounding symbols evoke themes of awareness, mysticism, vision, and cosmic connection. Giftable Art — Makes a perfect gift for lovers of spiritual art, cosmic design, or psychedelic visuals. Why Choose the 3I/ATLAS Mystic Eye Tapestry It isn’t just décor—it’s an experience. The design draws the viewer in and becomes a conversation piece in any room. Offers both aesthetic impact and practical size. Whether filling a large wall or anchoring a gallery layout, this tapestry holds its own. Texture and material quality ensure longevity; color‑safe print resists fading when cared for properly. Fits multiple styles: boho‑chic, cosmic, spiritual, mystic, psychedelic, or minimal with an edge. Care Instructions Hand‑wash or gentle machine wash cold; wash inside out to protect printed side Do not bleach Air dry flat or hang to dry If needed, iron on a low setting on reverse side, avoiding direct contact with printed artwork 104... [truncated]",
            "image_url": "https://images-api.printify.com/mockup/68cf870d4a1cc466510fb857/46151/2283/3iatlas-mystic-eye-wall-tapestry-cosmic-symbol-art-for-bedroom-studio-decor.jpg?camera_label=front",
            "shop": "3iAtlas"
        },
        {
            "id": "68cf870a4a1cc466510fb854",
            "title": "3I/Atlas Alien Sublimation Socks: Interstellar Style for Earthlings",
            "description": "3I/Atlas Alien Sublimation Socks : Interstellar Style for Earthlings Prepare for a fashion anomaly that transcends terrestrial trends! Introducing our exclusive 3I/Atlas Alien Sublimation Socks , crafted with patterns so mesmerizing, they're rumored to be sourced from an uncharted galaxy. These aren't just any colorful socks ; they're a visual transmission from the cosmos, bursting with vibrant hues of electric pink , deep space blue , nebula green , and cosmic orange . Designed for the adventurous spirit who believes style knows no earthly bounds, these otherworldly apparel pieces are truly in a league of their own, making them the ultimate choice for those seeking aliencore fashion . Embrace an aesthetic truly alien to this world, perfect for those who dare to defy the ordinary. Our futuristic socks feature a mind-bending, abstract pattern that swirls and shifts, creating an optical illusion that's both captivating and bold. They are the definitive accessory for championing unique socks and making a compelling statement . Whether you're navigating urban jungles or simply elevating your everyday ensemble, these vibrant crew socks promise to teleport your style to an entirely new dimension. Don the footwear of the cosmos and let your feet do the talking – or perhaps, the alien communicating.",
            "image_url": "https://images-api.printify.com/mockup/68cf870a4a1cc466510fb854/45133/53206/3iatlas-alien-sublimation-socks-interstellar-style-for-earthlings.jpg?camera_label=pose-1",
            "shop": "3iAtlas"
        },
        {
            "id": "68cf870b4a1cc466510fb855",
            "title": "Beyond the Stars: The 3I/Atlas Astral Voyager Encounter Poster",
            "description": "Beyond the Stars: The 3I/Atlas Astral Voyager Encounter Poster Unleash the awe of the cosmos with ""The Astral Voyager,"" a mesmerizing matte vertical poster that captures an extraordinary moment of interstellar connection. This vibrant artwork plunges you into a swirling vortex of deep blues and electric pinks, depicting a majestic astral voyager alien seemingly floating in a realm of mysterious plasma . With its multi-limbed form and luminous third eye, this ethereal being embodies ancient wisdom and boundless exploration, making it a powerful cosmic art statement piece for any space. Delve deeper into the narrative as this enigmatic entity, specifically an alien from 3I/Atlas – a celestial marvel often associated with Comet Atlas – embarks on a profound journey across the universe. The intricate background showcases distant galaxies and constellations, hinting at the vast distances traversed by this cosmic traveler . The artwork powerfully suggests a pivotal moment: an initial, perhaps cautious, glance at our world, foreshadowing an incredible extraterrestrial encounter with earthly humans . This piece is not just art; it's a window into a speculative future, a bridge between known reality and the profound mysteries of the unknown, ideal for collectors of sci-fi wall art and seekers of spiritual cosmic prints . Transform your living room, bedroom, or meditation space into a nexus of cosmic energy. This vibrant alien art is designed to spark conversations, inspire contemplation, and ignite the imagination of anyone captivated by the universe's grand narrative. It’s an exceptional gift for science fiction enthusiasts , UFO aficionados , and anyone who dreams of connections beyond our world. Let ""The Astral Voyager"" be your daily reminder of the infinite possibilities that lie within the cosmos and the potential for a wondrous human-alien interaction . Elevate... [truncated]",
            "image_url": "https://images-api.printify.com/mockup/68cf870b4a1cc466510fb855/43135/94677/beyond-the-stars-the-3iatlas-astral-voyager-encounter-poster.jpg?camera_label=front",
            "shop": "3iAtlas"
        },
        {
            "id": "68cf870d4a1cc466510fb858",
            "title": "Blast Off to the Cosmos with the 3I/Atlas Galaxy Journey Phone Case!",
            "description": "Blast Off to the Cosmos with the 3I/Atlas Galaxy Journey Phone Case! Prepare for launch with a phone case that captures the awe-inspiring moment the 3I/Atlas rocket ignites its engines, hurtling into the vast unknown. This isn't just a smartphone cover ; it's a vibrant portal to boundless adventure, depicting the magnificent spacecraft as it takes off into outerspace , setting a course toward our magnificent galaxy . The electrifying green exhaust plume and intricate, glowing cosmic ring design create a truly captivating futuristic aesthetic , making your device a beacon for all space exploration enthusiasts and dreamers of interstellar travel . Embrace your inner cosmic adventurer and let your device reflect your passion for the stars. Perfect for anyone who loves sci-fi design , epic journeys, and the mysteries of the universe , this unique tech accessory transforms your phone into a statement of ambition. Whether you're navigating urban jungles or charting digital frontiers, carry the spirit of a galaxy quest and the wonder of a neon rocket launch with you. Stand out from the crowd and show the world your journey is just beginning, wherever your mission takes you!",
            "image_url": "https://images-api.printify.com/mockup/68cf870d4a1cc466510fb858/112191/105690/blast-off-to-the-cosmos-with-the-3iatlas-galaxy-journey-phone-case.jpg?camera_label=front",
            "shop": "3iAtlas"
        },
        {
            "id": "68cf87054a1cc466510fb851",
            "title": "Cosmic Alien Vertical Posters, Space Decor, Wall Art, Gift for Sci-Fi Lovers, Home Aesthetic, Unique Room Decoration",
            "description": "Welcome Aboard the 3I/Atlas: Your Interstellar Invitation Poster Prepare for an unforgettable cosmic rendezvous with our captivating ""Welcome Aboard the 3I/Atlas"" poster. This breathtaking piece of sci-fi wall art plunges you into a vibrant, ethereal universe, where two radiant extraterrestrial beings extend a warm, silent greeting to humanity. Bathed in a spectacular palette of electric purples, deep blues, and shimmering pinks, the scene unfolds against a mesmerizing nebula backdrop , seemingly from within the legendary 3I/Atlas spaceship itself. It’s more than just a poster; it’s an open invitation to embrace the future of galactic exploration and the profound beauty of interstellar friendship. This evocative futuristic art print is an absolute must-have for any space enthusiast , science fiction fan , or collector of unique home decor . Imagine this powerful statement piece transforming your gaming room decor , sparking conversation in a modern living space , or inspiring wonder in a dorm room or personal study. Its vibrant energy and welcoming aura evoke a sense of boundless possibility, reminding us that the universe is vast, full of discovery, and ready to greet us. Perfect for dreamers worldwide , this poster encapsulates the spirit of cosmic adventure, offering a daily dose of wonder for those who dare to look beyond the horizon. 11″ x 14″ 12"" x 16"" 12″ x 18″ 16″ x 20″ Width, in 11.00 12.00 12.00 16.00 Length, in 14.00 16.00 18.00 20.00",
            "image_url": "https://images-api.printify.com/mockup/68cf87054a1cc466510fb851/43135/94677/cosmic-alien-vertical-posters-space-decor-wall-art-gift-for-sci-fi-lovers-... [truncated]",
            "shop": "3iAtlas"
        },
        {
            "id": "68cf87064a1cc466510fb852",
            "title": "Cosmic Hoedown: The 3I/ATLAS Extraterrestrial Jamboree T-Shirt",
            "description": "Step into a world where the extraordinary meets the everyday with our exclusive 'Cosmic Hoedown' T-shirt! This captivating design, part of our limited-time feature series celebrating cosmic phenomena, brings a whimsical narrative to life. Witness a charming grey alien and a jovial green goblin mid-jig in a sun-drenched wheat field, embodying the unexpected joy of interdimensional encounters. It's a playful twist on extraterrestrial tales and earthly folklore, making it an instant conversation starter for anyone who loves unique art and quirky fashion. Inspired by the wonder of celestial events and named in homage to the transient beauty of Comet 3I/ATLAS, this collectible tee symbolizes the brief, brilliant moments that capture our imagination. Whether you're an astronomy enthusiast, a follower of UFO lore, or simply appreciate a whimsical design that dares to be different, this shirt is designed for you. As part of our 3I/ATLAS feature series, this exclusive T-shirt will only be available for a limited time, much like the fleeting passage of a cosmic wonder. Don't miss your chance to own a piece of this stellar collection and let your style take an intergalactic leap! S M L XL 2XL 3XL 4XL 5XL Width, in 18.00 20.00 22.00 24.00 26.00 28.00 30.00 32.00 Length, in 28.00 29.00 30.00 31.00 32.00 33.00 34.00 35.00 Sleeve length (from center back), in 15.10 16.50 18.00 19.50 21.00 22.40 23.70 25.00 Size tolerance, in 1.50 1.50 1.50 1.50 1.50 1.50 1.50 1.50",
            "image_url": "https://images-api.printify.com/mockup/68cf87064a1cc466510fb852/12100/92570/cosmic-hoedown-the-3iatlas-extraterrestrial-jamboree-t-shirt.jpg?camera_label=front",
            "shop": "3iAtlas"
        },
        {
            "id": "68cf870a4a1cc466510fb853",
            "title": "Cosmic Wanderer's Warp: 3I/ATLAS Inspired Pink Alien Fanny Pack",
            "description": "Journey beyond the mundane with our out-of-this-world fanny pack, a truly stellar accessory designed for the modern explorer. Featuring an eye-catching pattern of playful pink aliens set against a vast, cosmic black background adorned with twinkling stars and mysterious UFOs, this waist bag is more than just a place to stash your essentials—it's a statement. This unique design is brilliantly inspired by the fleeting beauty and enigmatic allure of Comet 3I/ATLAS, capturing the wonder of interstellar discovery and bringing it straight to your everyday adventures. Perfect for festival circuits, urban explorations, or simply adding a touch of the extraordinary to your daily routine, this space-themed accessory ensures your style is always light-years ahead. Whether you're navigating bustling city streets or dancing under the open sky, enjoy the ultimate hands-free convenience with a piece that perfectly blends quirky fashion with celestial charm. Make a bold statement that echoes the universe’s endless possibilities and carry a piece of the cosmos, wherever your global travels or local explorations may take you. One size Height, in 6.00 Length, in 12.99 Strap width, in 0.98 Min circumference, in 39.37 Max circumference, in 53.54",
            "image_url": "https://images-api.printify.com/mockup/68cf870a4a1cc466510fb853/65045/6109/cosmic-wanderers-warp-3iatlas-inspired-pink-alien-fanny-pack.jpg?camera_label=front",
            "shop": "3iAtlas"
        },
        {
            "id": "68cf87014a1cc466510fb84f",
            "title": "Journey Beyond: The 3I/ATLAS Interstellar Comet Framed Poster",
            "description": "Journey Beyond: The 3I/ATLAS Interstellar Comet Framed Poster Embark on an epic celestial voyage with our stunning 3I/ATLAS Interstellar Comet framed poster, capturing the imagination of every space enthusiast. This captivating piece of astronomy art invites you to ponder the mysteries of the cosmos, depicting the legendary '3I/ATLAS' as it traverses the vast expanse between stars. With Earth and Mars prominently featured in its orbital path, this design isn't just a visual marvel; it's a profound statement about our place in the universe and the thrilling prospect of what lies beyond. Prepare for a truly immersive experience that resonates with the upcoming October 2025 celestial event , a rare glimpse into deep space as the comet makes its highly anticipated near-Earth approach. More than just wall decor , this vintage space poster serves as a dramatic focal point, sparking conversations and inspiring dreams of exploration. The intricate details of the interstellar comet , gracefully arcing past our planetary neighbors, evoke the excitement of a real-time cosmic phenomenon . Perfect for collectors of space exploration memorabilia or anyone seeking to infuse their home or office with a sense of wonder, this artwork uniquely commemorates the predicted path of Comet 3I/ATLAS near Earth and its spectacular journey towards Mars . Let this framed space print be your window to the ultimate interstellar mystery , a timeless tribute to the grand spectacle of our universe, eagerly anticipated by stargazers and astronomers worldwide. 6"" x 8"" (Vertical) 8″ x 10″ (Vertical) 11″ x 14″ (Vertical) 12″ x 18″ (Vertical) 16"" x 20"" (Vertical) 18″ x 24″ (Vertical) 20″ x 30″ (Vertical) 24"" x 32"" (Vertical) Frame width, in 7.87 9.84 12.87 13.86 18.03 19.88 21.89 25.87 Frame height, in 9.84 11.89 15.83 19.88 21.89 25.87 31.89 31.89 Frame depth, in 0.75 0.75 0.75 0.75 0.75 0.75 0... [truncated]",
            "image_url": "https://images-api.printify.com/mockup/68cf87014a1cc466510fb84f/43135/94677/journey-beyond-the-3iatlas-interstellar-comet-framed-poster.jpg?camera_label=front",
            "shop": "3iAtlas"
        },
        {
            "id": "68cf86fd4a1cc466510fb84d",
            "title": "The 3I/ATLAS Tee: Your Gateway to Interstellar Adventure",
            "description": "The 3I/ATLAS Tee: Your Gateway to Interstellar Adventure Ignite your imagination and launch into the cosmos with our exclusive 3I/ATLAS t-shirt . This striking design captures the thrilling concept of a theoretical spacecraft , the mighty 3I/ATLAS , embarking on an epic journey, seemingly penetrating the solar system . With its vibrant neon sci-fi aesthetic and depiction of a sleek, futuristic rocket against a mesmerizing pink-ringed celestial body, this tee is more than just apparel—it's a tribute to the boundless spirit of space exploration . Perfect for astronomy enthusiasts and dreamers who gaze beyond the stars, it's a statement piece for those who believe humanity's destiny lies among the galaxies. Unleash your inner pioneer and showcase your passion for the unknown with this visually captivating garment. The bold imagery and pixelated '3I/ATLAS' text evoke a sense of nostalgic futurism, appealing to fans of classic science fiction literature and modern speculative design alike. Whether you're exploring new frontiers in your everyday life or simply admiring the universe's majesty, this cosmic adventure apparel connects you to the grand narrative of discovery. It’s an ideal choice for anyone searching for a unique space-themed t-shirt , a distinctive rocket graphic tee , or interstellar travel fashion that stands out from the crowd. Embrace the mystery and excitement of what lies beyond our terrestrial sphere. This tee is meticulously crafted to resonate with search intent for terms like "" space exploration gifts ,"" "" sci-fi fan apparel ,"" and "" futuristic space art shirts ,"" ensuring it reaches those who share your passion for the final frontier. Don your 3I/ATLAS tee and wear your cosmic curiosity proudly, sparking conversations and inspiring others to look up and wonder. XS S M L XL 2XL 3XL 4XL 5XL Width, in 16.00 18.00 20.00 22.00 24.00 26.00 28.00 30.0... [truncated]",
            "image_url": "https://images-api.printify.com/mockup/68cf86fd4a1cc466510fb84d/12100/92570/the-3iatlas-tee-your-gateway-to-interstellar-adventure.jpg?camera_label=front",
            "shop": "3iAtlas"
        },
        {
            "id": "68cf87034a1cc466510fb850",
            "title": "Unleash Your Inner Alien DJ with This Synthwave Crewneck",
            "description": "Unleash Your Inner Alien DJ with This Synthwave Crewneck Prepare to transmit frequencies from another dimension with our exclusive Alien DJ Synthwave Crewneck . This isn't just a sweater; it's a direct portal to a universe where galactic beats reign supreme. Featuring a vibrant, neon green alien DJ meticulously saucer spinnin' on the decks, enveloped by pulsating yellow soundwave graphics , this design is for those who live and breathe electronic music culture . Command the room and resonate with otherworldly rhythms. Crafted for pioneers of sound and style, this black graphic sweater perfectly captures the essence of a boundless sonic journey. The dynamic synthwaves extending down the sleeves amplify the feeling of rhythm flowing through every fiber, making it an undeniable statement piece . Whether you're hitting up a rave , chilling at a music festival , or simply vibing to your favorite retro-futuristic tunes , this unisex crewneck broadcasts your passion for the extraterrestrial and the exquisite. It’s an essential addition to any space age fashion enthusiast's wardrobe. Step into your power as an intergalactic tastemaker. This cosmic style garment is more than just clothing; it's a beacon for outer space theme enthusiasts and anyone ready to ride the wave of interstellar sound. Embrace the energy, wear the rhythm, and let your fashion resonate with the frequencies of the universe. Get ready to turn heads and transmit good vibes with every wear, solidifying your status as a true connoisseur of interstellar fashion . S M L XL 2XL 3XL 4XL 5XL Width, in 20.00 22.01 24.00 26.00 28.00 30.00 32.00 34.00 Length, in 27.00 28.00 29.00 30.00 31.00 32.00 33.00 34.00 Sleeve length (from center back), in 33.50 34.50 35.50 36.50 37.50 38.50 39.50 40.50 Size tolerance, in 1.50 1.50 1.50 1.50 1.50 1.50 1.50 1.50",
            "image_url": "https://images-api.printify.com/mockup/68cf87034a1cc466510fb850/25458/98502/unleash-your-inner-alien-dj-with-this-synthwave-crewneck.jpg?camera_label=front",
            "shop": "3iAtlas"
        },
        {
            "id": "68cf870c4a1cc466510fb856",
            "title": "Unleash Your Inner Alien with the 3I/Atlas Cosmic Dream Phone Case!",
            "description": "Unleash Your Inner Alien with the 3I/Atlas Cosmic Dream Phone Case! Prepare for liftoff with our captivating phone case, a portal to the stars featuring an intricate pattern of vibrant pink alien faces against a deep, starry black backdrop. Inspired by the enigmatic beauty of the cosmos, this design draws directly from the celestial intrigue of Comet 3I/Atlas , bringing a piece of distant space exploration right to your fingertips. Each radiant pink alien face is meticulously placed, creating a hypnotic and dynamic visual that's truly out of this world. This isn't just a phone case; it's a declaration of your passion for the unknown, a subtle nod to extraterrestrial life and the wonders awaiting beyond our skies. Perfect for the stargazer, the sci-fi aficionado, or anyone who dares to be different, this cosmic phone cover transforms your device into a unique accessory. The subtle sparkling elements woven into the design evoke a truly authentic galaxy aesthetic , making your phone shimmer like a distant nebula. Whether you're searching for a standout alien themed gift or simply want to express your own unique style, this case offers an unbeatable combination of vivid artistry and undeniable charm. Embrace the mystery, flaunt your fascination with the cosmos, and let your phone case reflect your extraordinary spirit with this iconic patterned pink alien case . ```",
            "image_url": "https://images-api.printify.com/mockup/68cf870c4a1cc466510fb856/112191/105690/unleash-your-inner-alien-with-the-3iatlas-cosmic-dream-phone-case.jpg?camera_label=front",
            "shop": "3iAtlas"
        },
        {
            "id": "68cf87014a1cc466510fb84e",
            "title": "Unlock Your Cosmos: The Interstellar Odyssey Journal – Your Visionary Launchpad",
            "description": "Your next breakthrough isn't just waiting—it's ready to be documented. The Interstellar Odyssey Journal is far more than a simple hardcover journal; it's a dedicated launchpad for your deepest insights and grandest ambitions. Featuring a captivating celestial third eye on its cover, inspired by ancient wisdom and cosmic observation, it serves as a powerful reminder to see bigger, think deeper, and connect with the profound universe inside you. Drawing inspiration from intrepid cosmic travelers like ʻOumuamua and Borisov, this is the definitive space-themed journal for the modern adventurer, whether you're charting stars or mapping your destiny. Experience a surge of cosmic inspiration with every page. This isn't just a place for notes; it’s your personal atlas to decode dreams, map out master plans, and capture the fleeting thoughts that will sculpt your future. Tailored for the dedicated stargazer's notebook, the boundless creator, and the unwavering visionary, it invites you to record your own epic journey. Whether you're seeking a dedicated dream journal, a robust visionary planner, a sanctuary for creative writing journal entries, or a companion for your spiritual journey journal, the Interstellar Odyssey Journal provides the perfect space for profound self-discovery journal work and goal setting notebook enthusiasts. Don't just observe the universe—start writing your own magnificent chapter within it. Elevate your daily reflections and future aspirations with this unparalleled inspirational notebook. It makes an extraordinary and thoughtful unique gift for space lovers, writers, and anyone ready to truly unlock their cosmos and leverage the power of a manifestation journal to bring their deepest desires into reality. Journal Height, in 8.07 Width, in 5.71 Depth, in 0.55",
            "image_url": "https://images-api.printify.com/mockup/68cf87014a1cc466510fb84e/34240/3024/unlock-your-cosmos-the-interstellar-odyssey-journal-your-visionary-launchpad.jpg?camera_label=front",
            "shop": "3iAtlas"
        }
    ]
}
